
-- ==========================================================================================
-- 
--  USR
-- 
-- ==========================================================================================

-- ------------------------------------------------------------------------------------------
-- 
--  1. Create User seoil 
-- 
-- ------------------------------------------------------------------------------------------

sudo mariadb

ALTER USER 'root'@'localhost' IDENTIFIED BY 'seoilai'

CREATE USER 'seoil'@'%' IDENTIFIED BY 'seoilai';

GRANT ALL PRIVILEGES ON *.* TO 'seoil'@'%' WITH GRANT OPTION;

FLUSH PRIVILEGES;

exit




-- ------------------------------------------------------------------------------------------
-- 
--  2. Connect as User seoil 
-- 
-- ------------------------------------------------------------------------------------------

mariadb -u seoil -p 


-- ---- 원격접속>> 
 mariadb -h 158.179.167.140 -P 13890 -u seoil -p


password : seoilai

SELECT user,host,plugin,authentication_string FROM mysql.user;

show variables like 'c%';






-- ------------------------------------------------------------------------------------------
-- 
--  3. Delete User
-- 
-- ------------------------------------------------------------------------------------------

sudo mariadb

DROP USER Maria@'%';
SELECT user, host FROM mysql.user; 




