
-- ==========================================================================================
-- 
--  Create Database
-- 
-- ==========================================================================================


-- ------------------------------------------------------------------------------------------
-- 
--  0. show dbms info
-- 
-- ------------------------------------------------------------------------------------------

--  버전확인
SELECT VERSION();

--  엔진 및 문자셋 확인
SHOW VARIABLES LIKE 'version%';
SHOW VARIABLES LIKE 'character_set%';
SHOW VARIABLES LIKE 'collation%';


-- ------------------------------------------------------------------------------------------
-- 
--  1. Create Database
-- 
-- ------------------------------------------------------------------------------------------

Create DATABASE dbs_user;
SHOW CREATE DATABASE dbs_user;

-- ALTER DATABASE dbs_user CHARACTER SET utf8mb4 COLLATE utf8mb4_uca1400_as_cs;
-- SHOW CREATE DATABASE dbs_user;


USE dbs_user;